{"id":"libMovies","jsonrpc":"2.0","result":{"limits":{"end":533,"start":0,"total":533},"movies":[
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fwjnvCroLmiHF7r7yEPbAXYP9tpW.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f7c2Ls403MtnxXhYwsUVImL4EjOQ.jpg/"},"director":["Marc Webb"],"genre":["Comedy","Drama","Romance"],"label":"(500) Days of Summer","movieid":5,"mpaa":"Rated PG-13","plot":"After it looks as if she's left his life for good this time, Tom Hansen reflects back on the just over one year that he knew Summer Finn. Despite being physically average in almost every respect, Summer had always attracted the attention of men, Tom included. For Tom, it was love at first sight when she walked into the greeting card company where he worked, she the new administrative assistant. Soon, Tom knew that Summer was the woman with whom he wanted to spend the rest of his life. Although Summer did not believe in relationships or boyfriends - in her assertion, real life will always ultimately get in the way - Tom and Summer became more than just friends. Through the trials and tribulations of Tom and Summer's so-called relationship, Tom could always count on the advice of his two best friends, McKenzie and Paul. However, it is Tom's adolescent sister, Rachel, who is his voice of reason. After all is said and done, Tom is the one who ultimately has to make the choice to listen or...","plotoutline":"An offbeat romantic comedy about a woman who doesn't believe true love exists, and the young man who falls for her.","rating":7.8000001907348633,"runtime":5700,"studio":["Fox Searchlight Pictures"],"tagline":"It was almost like falling in love.","title":"(500) Days of Summer","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=PsD0NpFSADM","year":2009},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fuSFKHIt6osh0zYLalFjKQQjo2Ao.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f9W3CUFNJx3rJAFKFhvvghR4dC5m.jpg/"},"director":["Jon Lucas","Scott Moore"],"genre":["Comedy"],"label":"21 & Over","movieid":267,"mpaa":"Rated R","plot":"When Straight-A college student Jeff Chang's two best friends take him out for his 21st birthday on the night before an important medical school interview, what was supposed to be a quick beer becomes a night of humiliation, over indulgence and utter debauchery.","plotoutline":"The night before his big medical school interview, a promising student celebrates his 21st birthday with his two best friends.","rating":5.5999999046325684,"runtime":5580,"studio":["Mandeville Films"],"tagline":"Blackout the date","title":"21 & Over","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=CuoFP1R_5hc","year":2013},
{"art":{"fanart":"image://http%3a%2f%2fimage.tmdb.org%2ft%2fp%2foriginal%2frjDrnIzQGR7A3fik2RlLesVo4NY.jpg/","poster":"image://http%3a%2f%2fimage.tmdb.org%2ft%2fp%2foriginal%2fwAKUo12pRBGyFJQV27LFJoTvMU5.jpg/"},"director":["Judd Apatow"],"genre":["Comedy","Romance"],"label":"The 40 Year Old Virgin","movieid":605,"mpaa":"Rated R","plot":"Andy at the age of 40 still hasn't had sex. He lets his secret slip at a poker game with his buds from work. After the revealing all his friends are on a mission to help get him laid. Along the way Andy meets a nice mom: Trish who fall head over heels for each other.","plotoutline":"Goaded by his buddies, a nerdy guy who's never \"done the deed\" only finds the pressure mounting when he meets a single mother.","rating":7.1999998092651367,"runtime":6960,"studio":["Universal Pictures"],"tagline":"The Longer You Wait, The Harder It Gets.","title":"The 40 Year Old Virgin","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=hysIlCVLejk","year":2005},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2ffWQ7gjth0IkToVw9ceUSQDTCAgc.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fvlP18ooLmvYVNnqidbot0FupY05.jpg/"},"director":["Brian Helgeland"],"genre":["Biography","Drama","Sport"],"label":"42","movieid":316,"mpaa":"Rated PG-13","plot":"In 1946, Jackie Robinson is a Negro League baseball player who never takes racism lying down. Branch Rickey is a Major League team executive with a bold idea. To that end, Rickey recruits Robinson to break the unspoken color line as the first modern African American Major League player. As both anticipate, this proves a major challenge for Robinson and his family as they endure unrelenting racist hostility on and off the field, from player and fan alike. As Jackie struggles against his nature to endure such abuse without complaint, he finds allies and hope where he least expects it.","plotoutline":"The life story of Jackie Robinson and his history-making signing with the Brooklyn Dodgers under the guidance of team executive Branch Rickey.","rating":7.5,"runtime":7680,"studio":["Warner Bros."],"tagline":"In a game divided by color, he made us see greatness.","title":"42","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=BpxSdXnykTA","year":2013},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fkenir8OSC2gn5amaqykLSqClwOD.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f32tZc2nndes6xKDHR7sBibIEzZ7.jpg/"},"director":["Paul Almond","Michael Apted"],"genre":["Documentary"],"label":"56 Up","movieid":527,"mpaa":"Rated Not Rated","plot":"Director Michael Apted revisits the same group of British-born adults after a 7 year wait. The subjects are interviewed as to the changes that have occurred in their lives during the last seven years.","plotoutline":"Director Michael Apted revisits the same group of British-born adults after a 7 year wait. The subjects are interviewed as to the changes that have occurred in their lives during the last seven years.","rating":7.5999999046325684,"runtime":3600,"studio":["ITV Studios"],"tagline":"In 1964 a group of seven year old children were interviewed for \"Seven Up.\" They've been filmed every seven years since. NOW THEY ARE 56","title":"56 Up","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=7LZ5X-XoJ1Q","year":2012},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2feHUoB8NbvrvKp7KQMNgvc7yLpzM.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fe6zU02VGepkgmelc1hCVX76kx6i.jpg/"},"director":["Danny Boyle"],"genre":["Adventure","Biography","Drama","Thriller"],"label":"127 Hours","movieid":268,"mpaa":"Rated R","plot":"127 Hours is the true story of mountain climber Aron Ralston's remarkable adventure to save himself after a fallen boulder crashes on his arm and traps him in an isolated canyon in Utah. Over the next five days Ralston examines his life and survives the elements to finally discover he has the courage and the wherewithal to extricate himself by any means necessary, scale a 65 foot wall and hike over eight miles before he can be rescued. Throughout his journey, Ralston recalls friends, lovers, family, and the two hikers he met before his accident. Will they be the last two people he ever had the chance to meet?","plotoutline":"A mountain climber becomes trapped under a boulder while canyoneering alone near Moab, Utah and resorts to desperate measures in order to survive.","rating":7.6999998092651367,"runtime":5640,"studio":["Fox Searchlight Pictures"],"tagline":"There is no force more powerful than the will to live.","title":"127 Hours","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=7OWink5H0io","year":2010},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f2sStySEMtDgfi5kbr7xW0NZxyAU.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2feDiexVN4nO3ZdDZCDMiJOX5fQ5r.jpg/"},"director":["Stanley Kubrick"],"genre":["Adventure","Mystery","Sci-Fi"],"label":"2001: A Space Odyssey","movieid":6,"mpaa":"Rated G","plot":"\"2001\" is a story of evolution. Sometime in the distant past, someone or something nudged evolution by placing a monolith on Earth (presumably elsewhere throughout the universe as well). Evolution then enabled humankind to reach the moon's surface, where yet another monolith is found, one that signals the monolith placers that humankind has evolved that far. Now a race begins between computers (HAL) and human (Bowman) to reach the monolith placers. The winner will achieve the next step in evolution, whatever that may be.","plotoutline":"Humanity finds a mysterious, obviously artificial, object buried beneath the Lunar surface and, with the intelligent computer H.A.L. 9000, sets off on a quest.","rating":8.3000001907348633,"runtime":8460,"studio":["Metro-Goldwyn-Mayer (MGM)"],"tagline":"the time is now. [2001 re-release]","title":"2001: A Space Odyssey","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=E8TABIFAN4o","year":1968},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fwTdJGU5dRH1TI5VMqx7H4Jei8Cz.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fcbXrhflhU65t08PN9HXy6GLNa9X.jpg/"},"director":["Mark Christopher Covino","Jeff Howlett"],"genre":["Documentary"],"label":"A Band Called Death","movieid":528,"mpaa":"","plot":"Before Bad Brains, the Sex Pistols or even the Ramones, there was a band called Death. Punk before punk existed, three teenage brothers in the early '70s formed a band in their spare bedroom, began playing a few local gigs and even pressed a single in the hoped of getting signed. But this was the era of Motown and emerging disco. Record companies found Death's music - and band name - too intimidating, and the group were never given a fair shot, disbanding before they even completed one album. Equal parts electrifying rockumentary and epic family love story, A Band Called Death chronicles the incredible fairy-tale journey of what happened almost three decades later, when a dusty 1974 demo tape made it way out of the attic and found an audience several generations younger. Playing music impossible ahead of its time, Death is now being credited as the first black punk band (hell...the first punk band!), and are finally receiving their long overdue recognition as true rock pioneers.","plotoutline":"A documentary on the 1970s punk trio Death, and their new-found popularity decades after they disbanded.","rating":6.9000000953674316,"runtime":5760,"studio":["Haven Entertainment"],"tagline":"","title":"A Band Called Death","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=hAcLnf6Tx_A","year":2012},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f5YF6MwuuKBRKLUE2dz3wetkgxAE.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f4SFqHDZ1NvWdysucWbgnYlobdxC.jpg/"},"director":["Ron Howard"],"genre":["Biography","Drama"],"label":"A Beautiful Mind","movieid":385,"mpaa":"Rated PG-13","plot":"A biopic of the meteoric rise of John Forbes Nash Jr., a math prodigy able to solve problems that baffled the greatest of minds. And how he overcame years of suffering through schizophrenia to win the Nobel Prize.","plotoutline":"After a brilliant but asocial mathematician accepts secret work in cryptography, his life takes a turn to the nightmarish.","rating":8.1000003814697266,"runtime":8100,"studio":["Universal Pictures"],"tagline":"Wenn die Realität sich gegen Dich verschworen hat, ist nichts mehr sicher... (If reality has ganged up on you, nothing is safe anymore...)","title":"A Beautiful Mind","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=aS_d0Ayjw4o","year":2001},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fx0331koZw2d3G6luSeuHW9hX3jO.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fiHeLYaVLzvkVb0TZvJJoTZZg7XW.jpg/"},"director":["Bill Melendez"],"genre":["Animation","Comedy","Family"],"label":"A Charlie Brown Christmas","movieid":7,"mpaa":"Rated TV-G","plot":"When Charlie Brown complains about the overwhelming materialism that he sees amongst everyone during the Christmas season, Lucy suggests that he become director of the school Christmas paegent. Charlie Brown accepts, but it proves to be a frustrating struggle. When an attempt to restore the proper spirit with a forlorn little fir Christmas tree fails, he needs Linus' help to learn what the real meaning of Christmas is.","plotoutline":"Repelled by the commercialism he sees around him, Charlie Brown tries to find the true meaning of Christmas.","rating":8.3000001907348633,"runtime":1500,"studio":["Lee Mendelson Film Productions"],"tagline":"That's what Christmas is all about, Charlie Brown! (2008 DVD re-release)","title":"A Charlie Brown Christmas","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=JQeKdvXliIU","year":1965}
]
}
}
