{"id":"libMovies","jsonrpc":"2.0","result":{"limits":{"end":533,"start":0,"total":533},"movies":
[{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fwjnvCroLmiHF7r7yEPbAXYP9tpW.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f7c2Ls403MtnxXhYwsUVImL4EjOQ.jpg/"},"director":["Marc Webb"],"genre":["Comedy","Drama","Romance"],"label":"(500) Days of Summer","movieid":5,"mpaa":"Rated PG-13","plot":"After it looks as if she's left his life for good this time, Tom Hansen reflects back on the just over one year that he knew Summer Finn. Despite being physically average in almost every respect, Summer had always attracted the attention of men, Tom included. For Tom, it was love at first sight when she walked into the greeting card company where he worked, she the new administrative assistant. Soon, Tom knew that Summer was the woman with whom he wanted to spend the rest of his life. Although Summer did not believe in relationships or boyfriends - in her assertion, real life will always ultimately get in the way - Tom and Summer became more than just friends. Through the trials and tribulations of Tom and Summer's so-called relationship, Tom could always count on the advice of his two best friends, McKenzie and Paul. However, it is Tom's adolescent sister, Rachel, who is his voice of reason. After all is said and done, Tom is the one who ultimately has to make the choice to listen or...","plotoutline":"An offbeat romantic comedy about a woman who doesn't believe true love exists, and the young man who falls for her.","rating":7.8000001907348633,"runtime":5700,"studio":["Fox Searchlight Pictures"],"tagline":"It was almost like falling in love.","title":"(500) Days of Summer","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=PsD0NpFSADM","year":2009},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fuSFKHIt6osh0zYLalFjKQQjo2Ao.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f9W3CUFNJx3rJAFKFhvvghR4dC5m.jpg/"},"director":["Jon Lucas","Scott Moore"],"genre":["Comedy"],"label":"21 & Over","movieid":267,"mpaa":"Rated R","plot":"When Straight-A college student Jeff Chang's two best friends take him out for his 21st birthday on the night before an important medical school interview, what was supposed to be a quick beer becomes a night of humiliation, over indulgence and utter debauchery.","plotoutline":"The night before his big medical school interview, a promising student celebrates his 21st birthday with his two best friends.","rating":5.5999999046325684,"runtime":5580,"studio":["Mandeville Films"],"tagline":"Blackout the date","title":"21 & Over","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=CuoFP1R_5hc","year":2013},
{"art":{"fanart":"image://http%3a%2f%2fimage.tmdb.org%2ft%2fp%2foriginal%2frjDrnIzQGR7A3fik2RlLesVo4NY.jpg/","poster":"image://http%3a%2f%2fimage.tmdb.org%2ft%2fp%2foriginal%2fwAKUo12pRBGyFJQV27LFJoTvMU5.jpg/"},"director":["Judd Apatow"],"genre":["Comedy","Romance"],"label":"The 40 Year Old Virgin","movieid":605,"mpaa":"Rated R","plot":"Andy at the age of 40 still hasn't had sex. He lets his secret slip at a poker game with his buds from work. After the revealing all his friends are on a mission to help get him laid. Along the way Andy meets a nice mom: Trish who fall head over heels for each other.","plotoutline":"Goaded by his buddies, a nerdy guy who's never \"done the deed\" only finds the pressure mounting when he meets a single mother.","rating":7.1999998092651367,"runtime":6960,"studio":["Universal Pictures"],"tagline":"The Longer You Wait, The Harder It Gets.","title":"The 40 Year Old Virgin","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=hysIlCVLejk","year":2005},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2ffWQ7gjth0IkToVw9ceUSQDTCAgc.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fvlP18ooLmvYVNnqidbot0FupY05.jpg/"},"director":["Brian Helgeland"],"genre":["Biography","Drama","Sport"],"label":"42","movieid":316,"mpaa":"Rated PG-13","plot":"In 1946, Jackie Robinson is a Negro League baseball player who never takes racism lying down. Branch Rickey is a Major League team executive with a bold idea. To that end, Rickey recruits Robinson to break the unspoken color line as the first modern African American Major League player. As both anticipate, this proves a major challenge for Robinson and his family as they endure unrelenting racist hostility on and off the field, from player and fan alike. As Jackie struggles against his nature to endure such abuse without complaint, he finds allies and hope where he least expects it.","plotoutline":"The life story of Jackie Robinson and his history-making signing with the Brooklyn Dodgers under the guidance of team executive Branch Rickey.","rating":7.5,"runtime":7680,"studio":["Warner Bros."],"tagline":"In a game divided by color, he made us see greatness.","title":"42","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=BpxSdXnykTA","year":2013},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fkenir8OSC2gn5amaqykLSqClwOD.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f32tZc2nndes6xKDHR7sBibIEzZ7.jpg/"},"director":["Paul Almond","Michael Apted"],"genre":["Documentary"],"label":"56 Up","movieid":527,"mpaa":"Rated Not Rated","plot":"Director Michael Apted revisits the same group of British-born adults after a 7 year wait. The subjects are interviewed as to the changes that have occurred in their lives during the last seven years.","plotoutline":"Director Michael Apted revisits the same group of British-born adults after a 7 year wait. The subjects are interviewed as to the changes that have occurred in their lives during the last seven years.","rating":7.5999999046325684,"runtime":3600,"studio":["ITV Studios"],"tagline":"In 1964 a group of seven year old children were interviewed for \"Seven Up.\" They've been filmed every seven years since. NOW THEY ARE 56","title":"56 Up","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=7LZ5X-XoJ1Q","year":2012},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2feHUoB8NbvrvKp7KQMNgvc7yLpzM.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fe6zU02VGepkgmelc1hCVX76kx6i.jpg/"},"director":["Danny Boyle"],"genre":["Adventure","Biography","Drama","Thriller"],"label":"127 Hours","movieid":268,"mpaa":"Rated R","plot":"127 Hours is the true story of mountain climber Aron Ralston's remarkable adventure to save himself after a fallen boulder crashes on his arm and traps him in an isolated canyon in Utah. Over the next five days Ralston examines his life and survives the elements to finally discover he has the courage and the wherewithal to extricate himself by any means necessary, scale a 65 foot wall and hike over eight miles before he can be rescued. Throughout his journey, Ralston recalls friends, lovers, family, and the two hikers he met before his accident. Will they be the last two people he ever had the chance to meet?","plotoutline":"A mountain climber becomes trapped under a boulder while canyoneering alone near Moab, Utah and resorts to desperate measures in order to survive.","rating":7.6999998092651367,"runtime":5640,"studio":["Fox Searchlight Pictures"],"tagline":"There is no force more powerful than the will to live.","title":"127 Hours","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=7OWink5H0io","year":2010},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f2sStySEMtDgfi5kbr7xW0NZxyAU.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2feDiexVN4nO3ZdDZCDMiJOX5fQ5r.jpg/"},"director":["Stanley Kubrick"],"genre":["Adventure","Mystery","Sci-Fi"],"label":"2001: A Space Odyssey","movieid":6,"mpaa":"Rated G","plot":"\"2001\" is a story of evolution. Sometime in the distant past, someone or something nudged evolution by placing a monolith on Earth (presumably elsewhere throughout the universe as well). Evolution then enabled humankind to reach the moon's surface, where yet another monolith is found, one that signals the monolith placers that humankind has evolved that far. Now a race begins between computers (HAL) and human (Bowman) to reach the monolith placers. The winner will achieve the next step in evolution, whatever that may be.","plotoutline":"Humanity finds a mysterious, obviously artificial, object buried beneath the Lunar surface and, with the intelligent computer H.A.L. 9000, sets off on a quest.","rating":8.3000001907348633,"runtime":8460,"studio":["Metro-Goldwyn-Mayer (MGM)"],"tagline":"the time is now. [2001 re-release]","title":"2001: A Space Odyssey","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=E8TABIFAN4o","year":1968},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fwTdJGU5dRH1TI5VMqx7H4Jei8Cz.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fcbXrhflhU65t08PN9HXy6GLNa9X.jpg/"},"director":["Mark Christopher Covino","Jeff Howlett"],"genre":["Documentary"],"label":"A Band Called Death","movieid":528,"mpaa":"","plot":"Before Bad Brains, the Sex Pistols or even the Ramones, there was a band called Death. Punk before punk existed, three teenage brothers in the early '70s formed a band in their spare bedroom, began playing a few local gigs and even pressed a single in the hoped of getting signed. But this was the era of Motown and emerging disco. Record companies found Death's music - and band name - too intimidating, and the group were never given a fair shot, disbanding before they even completed one album. Equal parts electrifying rockumentary and epic family love story, A Band Called Death chronicles the incredible fairy-tale journey of what happened almost three decades later, when a dusty 1974 demo tape made it way out of the attic and found an audience several generations younger. Playing music impossible ahead of its time, Death is now being credited as the first black punk band (hell...the first punk band!), and are finally receiving their long overdue recognition as true rock pioneers.","plotoutline":"A documentary on the 1970s punk trio Death, and their new-found popularity decades after they disbanded.","rating":6.9000000953674316,"runtime":5760,"studio":["Haven Entertainment"],"tagline":"","title":"A Band Called Death","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=hAcLnf6Tx_A","year":2012},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f5YF6MwuuKBRKLUE2dz3wetkgxAE.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f4SFqHDZ1NvWdysucWbgnYlobdxC.jpg/"},"director":["Ron Howard"],"genre":["Biography","Drama"],"label":"A Beautiful Mind","movieid":385,"mpaa":"Rated PG-13","plot":"A biopic of the meteoric rise of John Forbes Nash Jr., a math prodigy able to solve problems that baffled the greatest of minds. And how he overcame years of suffering through schizophrenia to win the Nobel Prize.","plotoutline":"After a brilliant but asocial mathematician accepts secret work in cryptography, his life takes a turn to the nightmarish.","rating":8.1000003814697266,"runtime":8100,"studio":["Universal Pictures"],"tagline":"Wenn die Realität sich gegen Dich verschworen hat, ist nichts mehr sicher... (If reality has ganged up on you, nothing is safe anymore...)","title":"A Beautiful Mind","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=aS_d0Ayjw4o","year":2001},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fx0331koZw2d3G6luSeuHW9hX3jO.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fiHeLYaVLzvkVb0TZvJJoTZZg7XW.jpg/"},"director":["Bill Melendez"],"genre":["Animation","Comedy","Family"],"label":"A Charlie Brown Christmas","movieid":7,"mpaa":"Rated TV-G","plot":"When Charlie Brown complains about the overwhelming materialism that he sees amongst everyone during the Christmas season, Lucy suggests that he become director of the school Christmas paegent. Charlie Brown accepts, but it proves to be a frustrating struggle. When an attempt to restore the proper spirit with a forlorn little fir Christmas tree fails, he needs Linus' help to learn what the real meaning of Christmas is.","plotoutline":"Repelled by the commercialism he sees around him, Charlie Brown tries to find the true meaning of Christmas.","rating":8.3000001907348633,"runtime":1500,"studio":["Lee Mendelson Film Productions"],"tagline":"That's what Christmas is all about, Charlie Brown! (2008 DVD re-release)","title":"A Charlie Brown Christmas","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=JQeKdvXliIU","year":1965},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fwok0YepwQfBAPsrttFq0W6HXT2g.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fp2yuFxAyaBjdGrU2UBAqaE02NYG.jpg/"},"director":["Bob Clark"],"genre":["Comedy","Family"],"label":"A Christmas Story","movieid":8,"mpaa":"Rated PG","plot":"Ralphie, a young boy growing up in the '40's, dreams of owning a Red Rider BB gun. He sets out to convince the world this is the perfect gift. But along the way, he runs into opposition from his parents, his teacher, and even good 'ol Santa Claus himself.","plotoutline":"Ralphie has to convince his parents, teachers, and Santa that a Red Ryder B.B. gun really is the perfect gift for the 1940s.","rating":8,"runtime":5640,"studio":["Metro-Goldwyn-Mayer (MGM)"],"tagline":"Peace. Harmony. Comfort and Joy... Maybe Next Year.","title":"A Christmas Story","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=uvMLfSQrHKE","year":1983},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fsIxgqAYPenTIudaMPzD4kX1ZjBN.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fifbvvf3brbvndixHklUtXMZXlgJ.jpg/"},"director":["Joel Schumacher"],"genre":["Crime","Drama","Thriller"],"label":"A Time to Kill","movieid":386,"mpaa":"Rated R","plot":"In Canton, Mississippi, 10-year-old Tonya Hailey is viciously brutalized by two white racist rednecks -- James Louis \"Pete\" Willard and Billy Ray Cobb. Almost immediately after Tonya is found and rushed to a hospital, Pete and Billy Ray are found at a roadside bar, where they had been bragging about what they did to Tonya. Tonya's understandably distraught and enraged father, Carl Lee Hailey, remembers a case from a year ago, when four white men raped an African-American girl in a nearby town, and got acquitted. Carl is determined to not let that happen in this case. While deputy Dwayne Powell Looney is escorting Pete and Billy Ray up a flight of stairs to a court room, Carl emerges from the building's basement with an assault rifle, and he kills Pete and Billy Ray for what they did to Tonya. Carl is later arrested at his house by African-American sheriff Ozzie Walls, and Carl is scheduled to be placed on trial. Despite the efforts of the NAACP and local African-American leaders to ...","plotoutline":"A young lawyer defends a black man accused of murdering two men who raped his 10-year-old daughter, sparking a rebirth of the KKK.","rating":7.1999998092651367,"runtime":8940,"studio":["Regency Enterprises"],"tagline":"A lawyer and his assistant fighting to save a father on trial for murder. A time to question what they believe. A time to doubt what they trust. And no time for mistakes.","title":"A Time to Kill","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=O90-DO9P6q0","year":1996},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fqhE5V38CluaFt8wImZDHLGk2ntr.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fbskuFEdzBB9QyXqlgEvcOzIEzkw.jpg/"},"director":["William A. Wellman"],"genre":["Adventure","Romance","Western"],"label":"Across the Wide Missouri","movieid":487,"mpaa":"Rated Approved","plot":"In the 1830's beaver trapper Flint Mitchell and other white men hunt and trap in the then unnamed territories of Montana and Idaho. Flint marries a Blackfoot woman as a way to gain entrance into her people's rich lands, but finds she means more to him than a ticket to good beaver habitat.","plotoutline":"Trapper Flint Mitchell and other mountain men from the Rendezvous join forces to enter virgin trapping territory but must contend with a resentful Blackfoot chief.","rating":6.0999999046325684,"runtime":4680,"studio":["Metro-Goldwyn-Mayer (MGM)"],"tagline":"","title":"Across the Wide Missouri","trailer":"","year":1951},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fnlwzLx5WVZPZDwXvexGGfaktts7.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fg87PqGH9Oo3d3Tbczcfk7ZMAIEk.jpg/"},"director":["George Nolfi"],"genre":["Romance","Sci-Fi","Thriller"],"label":"The Adjustment Bureau","movieid":195,"mpaa":"Rated PG-13","plot":"Do we control our destiny, or do unseen forces manipulate us? A man glimpses the future Fate has planned for him and realizes he wants something else. To get it, he must pursue across, under and through the streets of modern-day New York the only woman he's ever loved. On the brink of winning a seat in the U.S. Senate, ambitious politician David Norris (Damon) meets beautiful contemporary ballet dancer Elise Sellas (Emily Blunt) - a woman like none he's ever known. But just as he realizes he's falling for her, mysterious men conspire to keep the two apart. David learns he is up against the agents of Fate itself - the men of The Adjustment Bureau - who will do everything in their considerable power to prevent David and Elise from being together. In the face of overwhelming odds, he must either let her go and accept a predetermined path...or risk everything to defy Fate and be with her.","plotoutline":"The affair between a politician and a ballerina is affected by mysterious forces keeping the lovers apart.","rating":7,"runtime":6360,"studio":["Universal Pictures"],"tagline":"Your Fate Has Been Adjusted","title":"The Adjustment Bureau","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=fSeWHl1PaKs","year":2011},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fuBbqvbuA3qX4WSPpiaz6mwju5q.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fjxNBmnP2Q1hTWuqCPUTRavGrjLt.jpg/"},"director":["Paul Weitz"],"genre":["Comedy","Drama","Romance"],"label":"Admission","movieid":493,"mpaa":"Rated PG-13","plot":"Straitlaced Princeton University admissions officer Portia Nathan (Tina Fey) is caught off-guard when she makes a recruiting visit to an alternative high school overseen by her former college classmate, the freewheeling John Pressman (Paul Rudd). Pressman has surmised that Jeremiah (Nat Wolff), his gifted yet very unconventional student, might well be the son that Portia secretly gave up for adoption many years ago. Soon, Portia finds herself bending the rules for Jeremiah, putting at risk the life she thought she always wanted -- but in the process finding her way to a surprising and exhilarating life and romance she never dreamed of having.","plotoutline":"A Princeton admissions officer who is up for a major promotion takes a professional risk after she meets a college-bound alternative school kid who just might be the son she gave up years ago in a secret adoption.","rating":5.5999999046325684,"runtime":0,"studio":["Depth of Field"],"tagline":"Get admitted.","title":"Admission","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=z2W7TaF9l6s","year":2013},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fq98RIq2DdJragrWAM5wWOxd5Qni.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fAnxlJgflHqwcSsdsgqH5R5hvnDl.jpg/"},"director":["Greg Mottola"],"genre":["Comedy","Drama","Romance"],"label":"Adventureland","movieid":9,"mpaa":"Rated R","plot":"In 1987, James Brennan's dreams of a summer European tour before studying at an Ivy League school in New York City are ruined after his parents have a severe career setback. As a result, James must get a summer job to cover his upcoming expenses at the decrepit local amusement park, Adventureland, where he falls in love with a witty co-worker, Emily Lewin. In that bizarrely shady workplace, the young carnies have unforgettable and painful learning experiences about life, love and trust while James discovers what he truly values.","plotoutline":"In the summer of 1987, a college grad takes a 'nowhere' job at his local amusement park, only to find it's the perfect course to get him prepared for the real world.","rating":6.9000000953674316,"runtime":6420,"studio":["Miramax Films"],"tagline":"It was the worst job they ever imagined... and the best time of their lives.","title":"Adventureland","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=ms9MMn-iIp0","year":2009},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f8iwLcbQYSccLlA7Z6NfF5heJ1dR.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fpmHRJPlAEiYATBIgKAa0IyY6Or7.jpg/"},"director":["Stephan Elliott"],"genre":["Comedy","Music"],"label":"The Adventures of Priscilla, Queen of the Desert","movieid":353,"mpaa":"Rated R","plot":"Two drag-queens (Anthony/Mitzi and Adam/Felicia) and a transexual (Bernadette) contract to perform a drag show at a resort in Alice Springs, a resort town in the remote Australian desert. They head west from Sydney aboard their lavender bus, Priscilla. En route, it is discovered that the woman they've contracted with is Anthony's wife. Their bus breaks down, and is repaired by Bob, who travels on with them.","plotoutline":"Two drag queens and a transsexual get a cabaret gig in the middle of the desert.","rating":7.3000001907348633,"runtime":6240,"studio":["PolyGram Filmed Entertainment"],"tagline":"She's back... Looking as gorgeous and outrageous as ever in a brand new frock.","title":"The Adventures of Priscilla, Queen of the Desert","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=Jtz7jaBpSKk","year":1994},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f9cZpG0wq2AgqClD1byTAh4dM3se.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fpaLlEn8AGGKawjq2aKdEHW9ai9e.jpg/"},"director":["Alastair Fothergill","Keith Scholey"],"genre":["Documentary","Adventure"],"label":"African Cats","movieid":10,"mpaa":"Rated G","plot":"A nature documentary centered on two cat families and how they teach their cubs the ways of the wild.","plotoutline":"A nature documentary centered on two cat families and how they teach their cubs the ways of the wild.","rating":7.3000001907348633,"runtime":5340,"studio":["Walt Disney Studios"],"tagline":"","title":"African Cats","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=NOGr1FzBrGI","year":2011},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fwG3jDXuliBfHBu81rqJEtC12HpA.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fvhK2BESu5lBskZqWCmtGaH24vDS.jpg/"},"director":["Andrew Jarecki"],"genre":["Crime","Drama","Mystery","Romance","Thriller"],"label":"All Good Things","movieid":11,"mpaa":"Rated R","plot":"A love story and murder mystery based on the most notorious unsolved murder case in New York history. The original screenplay uses newly discovered facts, court records and speculation as the foundation for a story of family, obsession, love and loss.","plotoutline":"Mr. David Marks was suspected but never tried for killing his wife Katie who disappeared in 1982, but the truth is eventually revealed.","rating":6.3000001907348633,"runtime":6060,"studio":["Groundswell Productions"],"tagline":"The Perfect Love Story. Until It Became The Perfect Crime.","title":"All Good Things","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=B7_VwoZKPRM","year":2010},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fmkBuRB1X6GRVQek0hYX4kArOXew.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fnyxdfpIJ9kZYXoEv4ZiCMIJ03wy.jpg/"},"director":["Cameron Crowe"],"genre":["Drama","Music"],"label":"Almost Famous","movieid":12,"mpaa":"Rated R","plot":"William Miller is a 15 year old kid, hired by Rolling Stone magazine to tour with, and write about Stillwater, an up and coming rock band. This wonderfully witty coming of age film follows William as he falls face first to confront life, love, and lingo.","plotoutline":"A high-school boy is given the chance to write a story for Rolling Stone Magazine about an up-and-coming rock band as he accompanies it on their concert tour.","rating":7.9000000953674316,"runtime":7320,"studio":["Columbia Pictures"],"tagline":"Experience it. Enjoy it. Just don't fall for it.","title":"Almost Famous","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=qk0XnyrENrE","year":2000},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fth3NL72ad2PhJwlljM5H2HQQwPg.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fvyFj7ZFm5AWApNGowpUzoakMuyS.jpg/"},"director":["Nick Cassavetes"],"genre":["Biography","Crime","Drama"],"label":"Alpha Dog","movieid":13,"mpaa":"Rated R","plot":"1999, Claremont, California. Middle-class kids, in their 20s, talk trash, wave guns, hang out in a pack. Johnny Truelove, drug dealer and son of a underworld figure, threatens Jake Mazursky, an explosive head case who owes Johnny money; Jake responds by breaking into Johnny's house. On impulse, Johnny and a couple pals kidnap Jake's 15-year-old brother, Zach. Zach's okay with it, figuring his brother will pay the debt soon. Johnny assigns his buddy Frankie to be Zach's minder, and they develop a brotherly friendship. Zach parties with his captors as things begin to spin out of control. Group think, amorality, and fear of prison assert a hold on the pack. Is Zach in danger?","plotoutline":"A drama based on the life of Jesse James Hollywood, a drug dealer who became one of the youngest men ever to be on the FBI's most wanted list.","rating":6.8000001907348633,"runtime":7320,"studio":["Sidney Kimmel Entertainment"],"tagline":"One crime. 3 days. 38 witnesses.","title":"Alpha Dog","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=SPbwocBe_tQ","year":2006},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2ffltrFAIcNp8Ut41DpAHQRVdmn7I.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fdpY7igIBW0Gw8LVLYgbCvjgc2aR.jpg/"},"director":["Betty Thomas"],"genre":["Animation","Comedy","Family","Fantasy","Music"],"label":"Alvin and the Chipmunks: The Squeakquel","movieid":14,"mpaa":"Rated PG","plot":"Pop sensations Alvin, Simon and Theodore end up in the care of Dave Seville's twenty-something nephew Toby. The boys must put aside music super stardom to return to school, and are tasked with saving the school's music program by winning the $25,000 prize in a battle of the bands. But the Chipmunks unexpectedly meet their match in three singing chipmunks known as The Chipettes -- Brittany, Eleanor and Jeanette. Romantic and musical sparks are ignited when the Chipmunks and Chipettes square off.","plotoutline":"The world famous singing pre-teen chipmunk trio return to contend with the pressures of school, celebrity, and a rival female music group known as The Chipettes.","rating":4.1999998092651367,"runtime":5280,"studio":["Fox 2000 Pictures"],"tagline":"The Boys are back in town... and they have competition","title":"Alvin and the Chipmunks: The Squeakquel","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=3DiQY9nSpX4","year":2009},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f7gz9Mz6HvfajG88MJTMWxb3NQl3.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fAtFhFTNbNo49qn7fkbo9lDtRkeR.jpg/"},"director":["Marc Webb"],"genre":["Action","Adventure","Fantasy"],"label":"The Amazing Spider-Man","movieid":518,"mpaa":"Rated PG-13","plot":"Like most teenagers, Peter is trying to figure out who he is and how he got to be the person he is today. Peter is also finding his way with his first high school crush, Gwen Stacy, and together, they struggle with love, commitment, and secrets. As Peter discovers a mysterious briefcase that belonged to his father, he begins a quest to understand his parents' disappearance - leading him directly to Oscorp and the lab of Dr Curt Connors, his father's former partner. As Spider-Man is set on a collision course with Connors' alter-ego, The Lizard, Peter will make life-altering choices to use his powers and shape his destiny to become a hero.","plotoutline":"Peter Parker finds a clue that might help him understand why his parents disappeared when he was young. His path puts him on a collision course with Dr. Curt Connors, his father's former partner.","rating":7.0999999046325684,"runtime":8160,"studio":["Columbia Pictures"],"tagline":"His past was kept from him. His search for answers has just begun.","title":"The Amazing Spider-Man","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=-tnxzJ0SSOw","year":2012},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fnxhfenC1jb5EcTI5GYxqnjYZMId.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f2AbFdmpvi6Z8AGrBY79JmnSGSOy.jpg/"},"director":["Jean-Pierre Jeunet"],"genre":["Comedy","Romance"],"label":"Amelie","movieid":317,"mpaa":"Rated R","plot":"Amélie is a story about a girl named Amélie whose childhood was suppressed by her Father's mistaken concerns of a heart defect. With these concerns Amélie gets hardly any real life contact with other people. This leads Amélie to resort to her own fantastical world and dreams of love and beauty. She later on becomes a young woman and moves to the central part of Paris as a waitress. After finding a lost treasure belonging to the former occupant of her apartment, she decides to return it to him. After seeing his reaction and his new found perspective - she decides to devote her life to the people around her. Such as, her father who is obsessed with his garden-gnome, a failed writer, a hypochondriac, a man who stalks his ex girlfriends, the \"ghost\", a suppressed young soul, the love of her life and a man whose bones are as brittle as glass. But after consuming herself with these escapades - she finds out that she is disregarding her own life and damaging her quest for love. Amélie then ...","plotoutline":"Amelie, an innocent and naive girl in Paris, with her own sense of justice, decides to help those around her and along the way, discovers love.","rating":8.5,"runtime":7320,"studio":["Claudie Ossard Productions"],"tagline":"One person can change your life forever.","title":"Amelie","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=HEFrLnS5sQY","year":2001},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2frRrMFgcn0rsNjywDzjAT5TofVXl.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2ffSjOt5mNKb1ht8oKu4mVICAwbAt.jpg/"},"director":["Anton Corbijn"],"genre":["Crime","Drama","Thriller"],"label":"The American","movieid":467,"mpaa":"Rated R","plot":"Alone among assassins, Jack is a master craftsman. When a job in Sweden ends more harshly than expected for this American abroad, he vows to his contact Pavel that his next assignment will be his last. Jack reports to the Italian countryside, where he holes up in a small town and relishes being away from death for a spell. The assignment, as specified by a Belgian woman, Mathilde, is in the offing as a weapon is constructed. Surprising himself, Jack seeks out the friendship of local priest Father Benedetto and pursues romance with local woman Clara. But by stepping out of the shadows, Jack may be tempting fate.","plotoutline":"An assassin hides out in Italy for one last assignment.","rating":6.4000000953674316,"runtime":6300,"studio":["Focus Features"],"tagline":"","title":"The American","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=ChQB0vpCQWw","year":2010},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fmAwd34SAC8KqBKRm2MwHPLhLDU5.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f3UBQGKS8c1dxRnDiu5kUK6ej3pP.jpg/"},"director":["Sam Mendes"],"genre":["Drama"],"label":"American Beauty","movieid":15,"mpaa":"Rated R","plot":"Lester and Carolyn Burnham are on the outside, a perfect husband and wife, in a perfect house, in a perfect neighborhood. But inside, Lester is slipping deeper and deeper into a hopeless depression. He finally snaps when he becomes infatuated with one of his daughter's friends. Meanwhile, his daughter Jane is developing a happy friendship with a shy boy-next-door named Ricky, who lives with a homophobic father.","plotoutline":"Lester Burnham, a depressed suburban father in a mid-life crisis, decides to turn his hectic life around after developing an infatuation for his daughter's attractive friend.","rating":8.5,"runtime":7320,"studio":["DreamWorks SKG"],"tagline":"... look closer","title":"American Beauty","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=3ycmmJ6rxA8","year":1999},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fuSWzHRan14Kxe7AgbA43CSN1fXw.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2frLWNo6B55xEPvoozPmooQGlkbyg.jpg/"},"director":["Ridley Scott"],"genre":["Biography","Crime","Drama"],"label":"American Gangster","movieid":16,"mpaa":"Rated R","plot":"Following the death of his employer and mentor, Bumpy Johnson, Frank Lucas establishes himself as the number one importer of heroin in the Harlem district of Manhattan. He does so by buying heroin directly from the source in South East Asia and he comes up with a unique way of importing the drugs into the United States. As a result, his product is superior to what is currently available on the street and his prices are lower. His alliance with the New York Mafia ensures his position. It is also the story of a dedicated and honest policeman, Richie Roberts, who heads up a joint narcotics task force with the Federal government. Based on a true story.","plotoutline":"In 1970s America, a detective works to bring down the drug empire of Frank Lucas, a heroin kingpin from Manhattan, who is smuggling the drug into the country from the Far East.","rating":7.8000001907348633,"runtime":9420,"studio":["Universal Pictures"],"tagline":"There are two sides to the American dream.","title":"American Gangster","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=BV_nssS6Zkg","year":2007},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fcrxlmQX74S5GRratmocQq2MauDi.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f8g9LKe8KDJz2sNDHKChwch8lykx.jpg/"},"director":["Chris Smith"],"genre":["Documentary"],"label":"American Movie","movieid":318,"mpaa":"Rated R","plot":"On the northwest side of Milwaukee, Mark Borchardt dreams the American dream: for him, it's making movies. Using relatives, local theater talent, slacker friends, his Mastercard, and $3,000 from his Uncle Bill, Mark strives over three years to finish \"Covan,\" a short horror film. His own personal demons (alcohol, gambling, a dysfunctional family) plague him, but he desperately wants to overcome self-doubt and avoid failure. In moments of reflection, Mark sees his story as quintessentially American, and its the nature and nuance of his dream that this film explores.","plotoutline":"Documentary about an aspiring filmmaker's attempts to finance his dream project by finally completing the low-budget horror film he abandoned years before.","rating":7.6999998092651367,"runtime":6420,"studio":["Bluemark Productions"],"tagline":"","title":"American Movie","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=P7N2Jz1en4w","year":1999},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fjlU4FvYxUXaxyYM0worlD7wHdQj.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2f7OAgvsZj6LA15KCXxrtVtXkFZhr.jpg/"},"director":["Paul Weitz"],"genre":["Comedy","Romance"],"label":"American Pie","movieid":17,"mpaa":"Rated R","plot":"Jim, Oz, Finch and Kevin are four friends who make a pact that before they graduate they will all lose their virginity. The hard job now is how to reach that goal by prom night. Whilst Oz begins singing to grab attention and Kevin tries to persuade his girlfriend, Finch tries any easy route of spreading rumors and Jim fails miserably. Whether it is being caught on top of a pie or on the Internet, Jim always end up with his trusty sex advice from his father. Will they achieve their goal of getting laid by prom night? or will they learn something much different.","plotoutline":"Four teenage boys enter a pact to lose their virginity by prom night.","rating":7,"runtime":5700,"studio":["Universal Pictures"],"tagline":"Come again!","title":"American Pie","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=iUZ3Yxok6N8","year":1999},
{"art":{"fanart":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2flaDq2WbQZD4Dtd87EfDzy0KF6MS.jpg/","poster":"image://http%3a%2f%2fcf2.imgobject.com%2ft%2fp%2foriginal%2fjWPLMG5pep99Xvx2hw3rN16H5Bl.jpg/"},"director":["Michael Haneke"],"genre":["Drama","Romance"],"label":"Amour","movieid":494,"mpaa":"Rated PG-13","plot":"Georges and Anne are a couple of retired music teachers enjoying life in their eighties. However, Anne suddenly has a stroke at breakfast and their lives are never the same. That incident begins Anne's harrowingly steep physical and mental decline as Georges attempts to care for her at home as she wishes. Even as the fruits of their lives and career remain bright, the couple's hopes for some dignity prove a dispiriting struggle even as their daughter enters the conflict. In the end, George, with his love fighting against his own weariness and diminished future on top of Anne's, is driven to make some critical decisions for them both.","plotoutline":"Georges and Anne are in their eighties. They are cultivated, retired music teachers. Their daughter, who is also a musician, lives abroad with her family. One day, Anne has an attack. The couple's bond of love is severely tested.","rating":7.8000001907348633,"runtime":7620,"studio":["Les Films du Losange"],"tagline":"","title":"Amour","trailer":"plugin://plugin.video.youtube/?action=play_video&videoid=VMOugpyFf3A","year":2012}
]}}
